# test

In [ ]:
### 정리
* .astype()은 원소에 적용되는가? 
    * No. 데이터셋 전체가 변환 가능한 자료형인 경우는 가능.
* .dtype 은 원소에 적용되는가?
    * No
* 열 원소 중에 하나라도 문자열이 있으면 그 열의 타입은 object로 나온다.

In [74]:
import pandas as pd

In [116]:
fruits = ['apple', 'tomato', 'pineapple', 'watermelon', 'grape']
price = ['5,000', '7000', '12,000', '15,000', '-']
count = [5, 3, 1, 2, 1]
etc = ['맛있다', '건강에 좋다', '-', '시원하다', 2]

In [117]:
dat = {'price': price, 'count' : count, 'etc' : etc}
dataset = pd.DataFrame(dat, index=fruits)

In [118]:
dataset

             price  count     etc
apple        5,000      5     맛있다
tomato        7000      3  건강에 좋다
pineapple   12,000      1       -
watermelon  15,000      2    시원하다
grape            -      1       2

In [119]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, apple to grape
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   price   5 non-null      object
 1   count   5 non-null      int64
 2   etc     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 160.0+ bytes

In [120]:
dataset.iloc[4,2]

2

In [121]:
dataset['etc'].dtype

dtype('O')

In [122]:
type(dataset.iloc[4,2])

int

In [123]:
dataset.iloc[1,0]

'7000'

In [98]:
int(dataset.iloc[1,0])

7000

In [99]:
dataset.iloc[1,0] = int(dataset.iloc[1,0])

In [100]:
type(dataset.iloc[1,0])

int

In [101]:
dataset['price']

apple          5,000
tomato          7000
pineapple     12,000
watermelon    15,000
grape
Name: price, dtype: object

In [113]:
dataset2 = dataset.copy()
dataset2

             price  count     etc
apple        5,000      5     맛있다
tomato        7000      3  건강에 좋다
pineapple   12,000      1
watermelon  15,000      2    시원하다
grape                   1       2

In [114]:
dataset2['price'].unique()

array(['5,000', 7000, '12,000', '15,000', ''], dtype=object)

In [115]:
dataset2['price'] = dataset2['price'].str.replace(',','')
dataset2['price']

apple          5000
tomato          NaN
pineapple     12000
watermelon    15000
grape
Name: price, dtype: object

### 문자열 교체와 자료형 변환 연습

In [140]:
fruits = ['apple', 'tomato', 'pineapple', 'watermelon', 'grape']
price = ['5,000', '7000', '12,000', '15,000', '-']
count = [5, 3, 1, 2, 1]
etc = ['맛있다', '건강에 좋다', '-', '시원하다', 2]

In [141]:
dat = {'price': price, 'count' : count, 'etc' : etc}
df = pd.DataFrame(dat, index=fruits)

In [142]:
df

             price  count     etc
apple        5,000      5     맛있다
tomato        7000      3  건강에 좋다
pineapple   12,000      1       -
watermelon  15,000      2    시원하다
grape            -      1       2

In [145]:
df['price'].unique()

array(['5,000', '7000', '12,000', '15,000', '-'], dtype=object)

In [147]:
df[df['price'] == '-']

      price  count etc
grape     -      1   2

In [148]:
df['price'] = df['price'].str.replace('-', '0')
df['price']

apple          5,000
tomato          7000
pineapple     12,000
watermelon    15,000
grape              0
Name: price, dtype: object

In [149]:
df['price'] = df['price'].str.replace(',','')
df['price']

apple          5000
tomato         7000
pineapple     12000
watermelon    15000
grape             0
Name: price, dtype: object

In [150]:
df['price'] = df['price'].astype('int64')
df['price']

apple          5000
tomato         7000
pineapple     12000
watermelon    15000
grape             0
Name: price, dtype: int64

In [151]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, apple to grape
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   price   5 non-null      int64
 1   count   5 non-null      int64
 2   etc     5 non-null      object
dtypes: int64(2), object(1)
memory usage: 332.0+ bytes

### 변환 가능한 자료로만 이루어진 데이터 셋 변환 연습

In [34]:
num = ['1', '2', '3', '4', '5']
num2 = ['10', '20', '30', '40', '50']
num_dat = {'num':num, 'num2': num2}
num_df = pd.DataFrame(num_dat)

In [35]:
num_df

  num num2
0   1   10
1   2   20
2   3   30
3   4   40
4   5   50

In [36]:
num_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   num     5 non-null      object
 1   num2    5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [43]:
num_df = num_df.astype('int64')
num_df

   num  num2
0    1    10
1    2    20
2    3    30
3    4    40
4    5    50

In [42]:
num_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   num     5 non-null      int64
 1   num2    5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

### 원소 하나씩 자료형 바꾸기 연습

In [197]:
num = ['1', '2', '3', 4, '5']
num2 = ['10', '20', 30, '40', '50']
num_dat = {'num':num, 'num2': num2}
num_df = pd.DataFrame(num_dat)
num_df

  num num2
0   1   10
1   2   20
2   3   30
3   4   40
4   5   50

In [198]:
num_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   num     5 non-null      object
 1   num2    5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [199]:
num_df['num'].unique(), num_df['num2'].unique()

(array(['1', '2', '3', 4, '5'], dtype=object),
 array(['10', '20', 30, '40', '50'], dtype=object))

In [200]:
a = int(1)
print(a)

1

In [201]:
# 4와 30을 문자형으로 변환
cols = num_df.columns
for i in range(len(cols)):
    for j in range(len(num_df.iloc[:, i])):
        # print(j, type(j))
        num_df.iloc[j, i] = int(num_df.iloc[j, i])

num_df['num'].unique(), num_df['num2'].unique()

(array([1, 2, 3, 4, 5], dtype=object),
 array([10, 20, 30, 40, 50], dtype=object))

In [202]:
num_df['num'] = num_df['num'].astype(int)

In [203]:
num_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   num     5 non-null      int32
 1   num2    5 non-null      object
dtypes: int32(1), object(1)
memory usage: 188.0+ bytes

### 소수인 문자형, 숫자형 혼합 데이터 처리 연습

In [208]:
f = ['1.5', '2.5', '3.5', 4.5, '5.5']
f2 = ['10.5', '20.5', 30.5, '40.5', '50.5']
num_dat = {'f':f, 'f2': f2}
num_df = pd.DataFrame(num_dat)
num_df

     f    f2
0  1.5  10.5
1  2.5  20.5
2  3.5  30.5
3  4.5  40.5
4  5.5  50.5

In [212]:
for col in num_df.columns:
    num_df[col] = num_df[col].astype(float)

num_df['f'].unique(), num_df['f'].dtype, num_df['f2'].unique(), num_df['f2'].dtype

(array([1.5, 2.5, 3.5, 4.5, 5.5]),
 dtype('float64'),
 array([10.5, 20.5, 30.5, 40.5, 50.5]),
 dtype('float64'))